#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/PosTechFiap33/ControlePedido/runs/run-7QuKGZNJ4ZdEoaYV

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.controle_pedidos_eks: Refreshing state... [id=controle-pedidos-cluster]
aws_eks_node_group.controle_pedido_node_group: Refreshing state... [id=controle-pedidos-cluster:controle-pedido-node-group]
aws_eks_cluster.controle_pedidos_eks: Drift detected (delete)
aws_eks_node_group.controle_pedido_node_group: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.controle_pedidos_eks has been deleted
  - resource "aws_eks_cluster" "controle_pedidos_eks" {
      - endpoint              = "https://DD7FE539D72F79F22295C171D8F95D75.gr7.us-east-1.eks.amazonaws.com" -> null
        id                    = "controle-pedidos-cluster"
      - name                  = "controle-pedidos-cluster" -> null
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.controle_pedidos_eks will be created
  + resource "aws_eks_cluster" "controle_pedidos_eks" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "controle-pedidos-cluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::752307938219:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-05328cfe41f0e19ec",
              + "subnet-0f2d12653bd147eff",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.controle_pedido_node_group will be created
  + resource "aws_eks_node_group" "controle_pedido_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "controle-pedidos-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
        ]
      + node_group_name        = "controle-pedido-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::752307938219:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05328cfe41f0e19ec",
          + "subnet-0f2d12653bd147eff",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_endpoint = "https://DD7FE539D72F79F22295C171D8F95D75.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FlavioRoberto, Action: `pull_request`*